# SQL with Python and Pandas Lab
Today we learned about relational databases and the language most use to query them, SQL.  In this lab we are going to practice converting information to a SQL DB, querying the data and then analyzing it with Python and just Python.

## Read in the EuroMart CSV Data
- 'EuroMart-ListOfOrders.csv'
- 'EuroMart-OrderBreakdown.csv'
- 'EuroMart-SalesTargets.csv'

In [92]:
import sqlite3

In [93]:
import pandas as pd
from pandas.io import sql

ListOfOrders = pd.read_csv('data/csv/EuroMart-ListOfOrders.csv', encoding = 'utf-8')
OrderBreakdown = pd.read_csv('data/csv/EuroMart-OrderBreakdown.csv', encoding = 'utf-8')
SalesTargets = pd.read_csv('data/csv/EuroMart-SalesTargets.csv', encoding = 'utf-8')

In [94]:
ListOfOrders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4117 entries, 0 to 4116
Data columns (total 10 columns):
Order ID         4117 non-null object
Order Date       4117 non-null object
Customer Name    4117 non-null object
City             4117 non-null object
Country          4117 non-null object
Region           4117 non-null object
Segment          4117 non-null object
Ship Date        4117 non-null object
Ship Mode        4117 non-null object
State            4117 non-null object
dtypes: object(10)
memory usage: 321.7+ KB

In [95]:
OrderBreakdown.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8047 entries, 0 to 8046
Data columns (total 8 columns):
Order ID        8047 non-null object
Product Name    8047 non-null object
Discount        8047 non-null float64
Sales           8047 non-null object
Profit          8047 non-null object
Quantity        8047 non-null int64
Category        8047 non-null object
Sub-Category    8047 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 503.0+ KB

In [96]:
SalesTargets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
Month of Order Date    144 non-null object
Category               144 non-null object
Target                 144 non-null object
dtypes: object(3)
memory usage: 3.4+ KB

In [97]:
ListOfOrders.head()

,Order ID,Order Date,Customer Name,City,Country,Region,Segment,Ship Date,Ship Mode,State
0,BN-2011-7407039,1/1/2011,Ruby Patel,Stockholm,Sweden,North,Home Office,1/5/2011,Economy Plus,Stockholm
1,AZ-2011-9050313,1/3/2011,Summer Hayward,Southport,United Kingdom,North,Consumer,1/7/2011,Economy,England
2,AZ-2011-6674300,1/4/2011,Devin Huddleston,Valence,France,Central,Consumer,1/8/2011,Economy,Auvergne-Rhône-Alpes
3,BN-2011-2819714,1/4/2011,Mary Parker,Birmingham,United Kingdom,North,Corporate,1/9/2011,Economy,England
4,AZ-2011-617423,1/5/2011,Daniel Burke,Echirolles,France,Central,Home Office,1/7/2011,Priority,Auvergne-Rhône-Alpes

In [98]:
OrderBreakdown.head(10)

,Order ID,Product Name,Discount,Sales,Profit,Quantity,Category,Sub-Category
0,BN-2011-7407039,"Enermax Note Cards, Premium",0.5,$45.00,-$26.00,3,Office Supplies,Paper
1,AZ-2011-9050313,"Dania Corner Shelving, Traditional",0.0,$854.00,$290.00,7,Furniture,Bookcases
2,AZ-2011-6674300,"Binney & Smith Sketch Pad, Easy-Erase",0.0,$140.00,$21.00,3,Office Supplies,Art
3,BN-2011-2819714,"Boston Markers, Easy-Erase",0.5,$27.00,-$22.00,2,Office Supplies,Art
4,BN-2011-2819714,"Eldon Folders, Single Width",0.5,$17.00,-$1.00,2,Office Supplies,Storage
5,AZ-2011-617423,"Binney & Smith Pencil Sharpener, Water Color",0.0,$90.00,$21.00,3,Office Supplies,Art
6,AZ-2011-617423,"Sanford Canvas, Fluorescent",0.0,$207.00,$77.00,4,Office Supplies,Art
7,AZ-2011-2918397,"Bush Floating Shelf Set, Pine",0.1,$155.00,$36.00,1,Furniture,Bookcases
8,AZ-2011-2918397,"Accos Thumb Tacks, Assorted Sizes",0.0,$33.00,$2.00,3,Office Supplies,Fasteners
9,AZ-2011-2918397,"Smead Lockers, Industrial",0.1,$716.00,$143.00,4,Office Supplies,Storage

In [99]:
OrderBreakdown.head()

,Order ID,Product Name,Discount,Sales,Profit,Quantity,Category,Sub-Category
0,BN-2011-7407039,"Enermax Note Cards, Premium",0.5,$45.00,-$26.00,3,Office Supplies,Paper
1,AZ-2011-9050313,"Dania Corner Shelving, Traditional",0.0,$854.00,$290.00,7,Furniture,Bookcases
2,AZ-2011-6674300,"Binney & Smith Sketch Pad, Easy-Erase",0.0,$140.00,$21.00,3,Office Supplies,Art
3,BN-2011-2819714,"Boston Markers, Easy-Erase",0.5,$27.00,-$22.00,2,Office Supplies,Art
4,BN-2011-2819714,"Eldon Folders, Single Width",0.5,$17.00,-$1.00,2,Office Supplies,Storage

In [100]:
SalesTargets.head()

  Month of Order Date   Category      Target
0              Jan-11  Furniture  $10,000.00
1              Feb-11  Furniture  $10,100.00
2              Mar-11  Furniture  $10,300.00
3              Apr-11  Furniture  $10,400.00
4              May-11  Furniture  $10,500.00

## Create a SQL Database called 'EuroMart' and save the three dataframes as SQL tables.

In [101]:
connection = sqlite3.connect('data/sql/test.db.sqlite')
ListOfOrders.to_sql(name = 'ListOfOrders', con = connection, if_exists = 'replace', index = False)
connection = sqlite3.connect('data/sql/test.db.sqlite')
OrderBreakdown.to_sql(name = 'OrderBreakdown', con = connection, if_exists = 'replace', index = False)
connection = sqlite3.connect('data/sql/test.db.sqlite')
SalesTargets.to_sql(name = 'SalesTargets', con = connection, if_exists = 'replace', index = False)

### 1. How many orders has each Customer placed?

In [109]:
connection = sqlite3.connect('data/sql/test.db.sqlite')
query1 = 'SELECT `Customer Name`,`Order ID` FROM ListOfOrders'
q_order = sql.read_sql(query1, con = connection)


q_order.groupby('Customer Name').count()

                      Order ID
Customer Name
Aaron Bootman               11
Aaron Cunningham             8
Aaron Davey                  4
Aaron Macrossan              1
Abbie Perry                  4
Abby Colebe                  3
Abby Mei                     6
Abby Muramats                5
Abigail Humffray             5
Ada Dalton                   4
Adam Bentley                 3
Adam Gibbs                   4
Adam Harte                   8
Adam Peacock                 4
Adam Walpole                 7
Aidan Hayward                7
Aidan Rowe                   8
Alana Tyson                  4
Alana Zahel                  7
Alannah Callaway             5
Alannah Langridge            9
Alex Greenwood               7
Alexander Bennett            6
Alexander Bond               4
Alexandra Macdonald         10
Alexandra Mahmood            1
Alexandra Portus             5
Alexandra Whitehouse         7
Alexis Code                  8
Alexis O'Flaherty            3
...                        ...
Tyson Jonathan               9
Vaughn Gibbs                 5
Victor Kron                  5
Victoria Bell                3
Victoria Burke               4
Viola Watson                 5
Walter Aguilar               7
Walter Coley                 6
Wanda Wingert                3
Will Poynton                 7
William Horton               5
William Jolly                5
William Martin               3
William Reichert             4
William Somerville           5
Winnie Moss                  6
Wynona Janelle               4
Xavier Burford               6
Xavier Martindale            3
Xavier Synan                 5
Yasmin Bradley               3
Yasmin Higgins               2
Zachary Disher               7
Zachary Warner               9
Zara Jennings                2
Zara Loton                   3
Zara Money                   5
Zoe Lanigan                  4
Zoe Lowin                    4
Zona Meyer                   8

[792 rows x 1 columns]

##### *If you're doubting your output check using Pandas

### 2. Create a Query to return a table of only Geographic features from the List of Orders Table.

In [26]:

query3= 'SELECT City,State,Region,Country FROM ListOfOrders'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query3, con = connection)

q_order.head()

         City                 State   Region         Country
0   Stockholm             Stockholm    North          Sweden
1   Southport               England    North  United Kingdom
2     Valence  Auvergne-Rhône-Alpes  Central          France
3  Birmingham               England    North  United Kingdom
4  Echirolles  Auvergne-Rhône-Alpes  Central          France

### 3. Create a Query to return a table with all of the orders that had a negative profit from the Order Breakdown Table.

In [29]:
query4= 'SELECT Profit,`Order ID` FROM OrderBreakdown'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query4, con = connection)

In [32]:
q_order['Profit'] = q_order['Profit'].str.replace(',', '')
q_order['Profit'] = q_order['Profit'].str.replace('$', '')
q_order['Profit']= q_order['Profit'].astype(float)
q_order.head(10)

   Profit         Order ID
0   -26.0  BN-2011-7407039
1   290.0  AZ-2011-9050313
2    21.0  AZ-2011-6674300
3   -22.0  BN-2011-2819714
4    -1.0  BN-2011-2819714
5    21.0   AZ-2011-617423
6    77.0   AZ-2011-617423
7    36.0  AZ-2011-2918397
8     2.0  AZ-2011-2918397
9   143.0  AZ-2011-2918397

In [39]:

q_order.to_sql(name = 'q_order_2', con = connection, if_exists = 'replace', index = False)
query4= 'SELECT Profit,`Order ID` FROM q_order_2 WHERE (Profit <0)'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query4, con = connection)

q_order.head(10)

   Profit         Order ID
0   -26.0  BN-2011-7407039
1   -22.0  BN-2011-2819714
2    -1.0  BN-2011-2819714
3 -1012.0  BN-2011-3248724
4   -56.0  BN-2011-3248724
5  -342.0  AZ-2011-6439906
6    -6.0  AZ-2011-2222024
7    -3.0  BN-2011-4913858
8   -12.0  BN-2011-4913858
9   -38.0  BN-2011-4913858

### 4. Construct a query to return a table with the Customer Name and Product Name.  
(This will require a Join)

In [40]:
query4= 'SELECT `Product Name`,`Customer Name` FROM ListOfOrders,OrderBreakdown where ListOfOrders.`Order ID` = OrderBreakdown.`Order ID`'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query4, con = connection)

q_order.head(10)

                                   Product Name       Customer Name
0                   Enermax Note Cards, Premium          Ruby Patel
1            Dania Corner Shelving, Traditional      Summer Hayward
2         Binney & Smith Sketch Pad, Easy-Erase    Devin Huddleston
3                    Boston Markers, Easy-Erase         Mary Parker
4                   Eldon Folders, Single Width         Mary Parker
5  Binney & Smith Pencil Sharpener, Water Color        Daniel Burke
6                   Sanford Canvas, Fluorescent        Daniel Burke
7             Accos Thumb Tacks, Assorted Sizes  Fredrick Beveridge
8                 Bush Floating Shelf Set, Pine  Fredrick Beveridge
9                     Smead Lockers, Industrial  Fredrick Beveridge

##### From this point on you'll probably be combining SQL and Pandas, in that you would use SQL querys to gather the relevant information and use Pandas to analyze it.

### 5.  How many orders for "Office Supplies" (Category) has Sweeden made?

In [47]:
query5= 'SELECT `Category`,`Country` FROM ListOfOrders,OrderBreakdown where (ListOfOrders.`Order ID` = OrderBreakdown.`Order ID`)'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query5, con = connection)



q_order.groupby('Country').Category.value_counts()

Country         Category
Austria         Office Supplies     177
                Technology           47
                Furniture            40
Belgium         Office Supplies      96
                Furniture            20
                Technology           19
Denmark         Office Supplies      39
                Technology           12
                Furniture             9
Finland         Office Supplies      38
                Furniture            16
                Technology           10
France          Office Supplies    1231
                Technology          386
                Furniture           299
Germany         Office Supplies    1065
                Technology          311
                Furniture           264
Ireland         Office Supplies      67
                Technology           21
                Furniture            12
Italy           Office Supplies     656
                Technology          187
                Furniture           136
Netherlands     Office Supplies     242
                Furniture            76
                Technology           75
Norway          Office Supplies      46
                Technology           18
                Furniture             6
Portugal        Office Supplies      47
                Technology           13
                Furniture            10
Spain           Office Supplies     503
                Technology          135
                Furniture           123
Sweden          Office Supplies     133
                Furniture            36
                Technology           34
Switzerland     Office Supplies      54
                Technology           13
                Furniture            11
United Kingdom  Office Supplies     892
                Technology          242
                Furniture           180
Name: Category, dtype: int64

### 6. What was the total sales for products that have been discounted?

In [60]:
OrderBreakdown.head()

,Order ID,Product Name,Discount,Sales,Profit,Quantity,Category,Sub-Category
0,BN-2011-7407039,"Enermax Note Cards, Premium",0.5,45.00,-$26.00,3,Office Supplies,Paper
1,AZ-2011-9050313,"Dania Corner Shelving, Traditional",0.0,854.00,290.00,7,Furniture,Bookcases
2,AZ-2011-6674300,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.00,21.00,3,Office Supplies,Art
3,BN-2011-2819714,"Boston Markers, Easy-Erase",0.5,27.00,-$22.00,2,Office Supplies,Art
4,BN-2011-2819714,"Eldon Folders, Single Width",0.5,17.00,-$1.00,2,Office Supplies,Storage

In [48]:
query6= 'SELECT Discount,`Product Name`,Sales FROM OrderBreakdown WHERE (Discount >0)'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query6, con = connection)


q_order['Sales'] = q_order['Sales'].str.replace(',', '')
q_order['Sales'] = q_order['Sales'].str.replace('$', '')
q_order['Sales']= q_order['Sales'].astype(float)



q_order.groupby(['Product Name']).Sales.sum()

Product Name
Acco 3-Hole Punch, Clear                      148.0
Acco 3-Hole Punch, Durable                    215.0
Acco 3-Hole Punch, Economy                    217.0
Acco 3-Hole Punch, Recycled                   168.0
Acco Binder Covers, Clear                      32.0
Acco Binder Covers, Durable                   104.0
Acco Binder Covers, Economy                    77.0
Acco Binder Covers, Recycled                   34.0
Acco Binder, Clear                             39.0
Acco Binder, Durable                           58.0
Acco Binding Machine, Durable                 284.0
Acco Binding Machine, Economy                 154.0
Acco Binding Machine, Recycled                437.0
Acco Hole Reinforcements, Clear                24.0
Acco Hole Reinforcements, Durable              93.0
Acco Hole Reinforcements, Recycled             20.0
Acco Index Tab, Clear                          55.0
Acco Index Tab, Durable                         9.0
Acco Index Tab, Economy                        35.0
Accos Clamps, 12 Pack                          47.0
Accos Clamps, Assorted Sizes                   17.0
Accos Clamps, Metal                            29.0
Accos Paper Clips, Assorted Sizes               6.0
Accos Push Pins, 12 Pack                       14.0
Accos Push Pins, Assorted Sizes                18.0
Accos Push Pins, Bulk Pack                     15.0
Accos Push Pins, Metal                         22.0
Accos Rubber Bands, 12 Pack                    43.0
Accos Rubber Bands, Bulk Pack                  30.0
Accos Rubber Bands, Metal                      15.0
                                              ...
Tenex Trays, Industrial                       739.0
Tenex Trays, Single Width                     788.0
Tenex Trays, Wire Frame                       757.0
Wilson Jones 3-Hole Punch, Durable            112.0
Wilson Jones 3-Hole Punch, Economy            384.0
Wilson Jones Binder Covers, Clear              16.0
Wilson Jones Binder Covers, Durable            69.0
Wilson Jones Binder Covers, Economy            62.0
Wilson Jones Binder Covers, Recycled           12.0
Wilson Jones Binder, Durable                   29.0
Wilson Jones Binder, Economy                   40.0
Wilson Jones Binder, Recycled                  74.0
Wilson Jones Binding Machine, Clear           218.0
Wilson Jones Binding Machine, Durable         151.0
Wilson Jones Binding Machine, Economy         269.0
Wilson Jones Binding Machine, Recycled        173.0
Wilson Jones Hole Reinforcements, Clear        14.0
Wilson Jones Hole Reinforcements, Durable      18.0
Wilson Jones Hole Reinforcements, Economy      14.0
Wilson Jones Hole Reinforcements, Recycled      7.0
Wilson Jones Index Tab, Clear                  12.0
Wilson Jones Index Tab, Durable                16.0
Wilson Jones Index Tab, Recycled               27.0
Xerox Computer Printout Paper, 8.5 x 11        30.0
Xerox Computer Printout Paper, Premium         71.0
Xerox Computer Printout Paper, Recycled       106.0
Xerox Message Books, 8.5 x 11                 154.0
Xerox Message Books, Premium                   55.0
Xerox Note Cards, Premium                      13.0
Xerox Note Cards, Recycled                     52.0
Name: Sales, dtype: float64

### 7. What is the total quantity of objects sold for each country?

In [99]:

query7= 'SELECT `Country`,`Quantity` FROM ListOfOrders,OrderBreakdown where ListOfOrders.`Order ID` = OrderBreakdown.`Order ID`'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query7, con = connection)

q_order.head(10)

q_order.groupby(['Country']).Quantity.sum()

Country
Austria            973
Belgium            532
Denmark            204
Finland            201
France            7329
Germany           6179
Ireland            392
Italy             3612
Netherlands       1526
Norway             261
Portugal           286
Spain             2881
Sweden             753
Switzerland        308
United Kingdom    4917
Name: Quantity, dtype: int64

### 8. In what Countries are profits lowest? (Report lowest 5-10)

In [111]:
query8= 'SELECT `Country`,`Profit` FROM ListOfOrders,OrderBreakdown where ListOfOrders.`Order ID` = OrderBreakdown.`Order ID`'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query8, con = connection)

q_order['Profit'] = q_order['Profit'].str.replace(',', '')
q_order['Profit'] = q_order['Profit'].str.replace('$', '')
q_order['Profit'] = q_order['Profit'].astype(float)

q_order.groupby('Country').Profit.sum().order()

/anaconda/envs/py27/lib/python2.7/site-packages/ipykernel/__main__.py:9: FutureWarning: order is deprecated, use sort_values(...)

Country
Netherlands      -37188.0
Sweden           -17524.0
Portugal          -8704.0
Ireland           -6886.0
Denmark           -3608.0
Finland            3908.0
Norway             5167.0
Switzerland        7234.0
Belgium            9912.0
Italy             15802.0
Austria           21332.0
Spain             47067.0
France            70067.0
Germany           86279.0
United Kingdom    90382.0
Name: Profit, dtype: float64

### 9. What Counties have the best and worst Sales to Profit Ratios?
(Total Sales divided by Total Profits.)
Essentially this is saying for every dollar of product sold, how much is profit

In [115]:
query9= 'SELECT `Country`,Sales,`Profit` FROM ListOfOrders,OrderBreakdown where ListOfOrders.`Order ID` = OrderBreakdown.`Order ID`'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query9, con = connection)

q_order['Profit'] = q_order['Profit'].str.replace(',', '')
q_order['Profit'] = q_order['Profit'].str.replace('$', '')
q_order['Profit'] = q_order['Profit'].astype(float)

q_order['Sales'] = q_order['Sales'].str.replace(',', '')
q_order['Sales'] = q_order['Sales'].str.replace('$', '')
q_order['Sales'] = q_order['Sales'].astype(float)

q_order['ratio'] = q_order['Sales']/q_order['Profit']
q_order.head()

q_order.groupby('Country').ratio.agg(['max'])
q_order.groupby('Country').ratio.agg(['min'])

          Country  Sales  Profit      ratio
0          Sweden   45.0   -26.0  -1.730769
1  United Kingdom  854.0   290.0   2.944828
2          France  140.0    21.0   6.666667
3  United Kingdom   17.0    -1.0 -17.000000
4  United Kingdom   27.0   -22.0  -1.227273

### 10. What Shipping method is most common for 'Bookcases' (Sub Category)

In [61]:
query10= 'SELECT `Sub-Category`,`Ship Mode` FROM ListOfOrders,OrderBreakdown where ListOfOrders.`Order ID` = OrderBreakdown.`Order ID`'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query10, con = connection)

q_order.head()
q_order.rename(columns=lambda x: x.replace(' ', '_'), inplace=True)
q_order.groupby('Sub-Category').Ship_Mode.max()

Sub-Category
Accessories    Priority
Appliances     Priority
Art            Priority
Binders        Priority
Bookcases      Priority
Chairs         Priority
Copiers        Priority
Envelopes      Priority
Fasteners      Priority
Furnishings    Priority
Labels         Priority
Machines       Priority
Paper          Priority
Phones         Priority
Storage        Priority
Supplies       Priority
Tables         Priority
Name: Ship_Mode, dtype: object

### 11 .What city in the Orders table generated the highest net sales?  (List all the cities and countries in descending order by net sales.)

In [155]:
query11= 'SELECT `City`,`Sales` FROM ListOfOrders,OrderBreakdown where ListOfOrders.`Order ID` = OrderBreakdown.`Order ID`'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query11, con = connection)


q_order['Sales'] = q_order['Sales'].str.replace(',', '')
q_order['Sales'] = q_order['Sales'].str.replace('$', '')
q_order['Sales'] = q_order['Sales'].astype(float)
q_order.head()

q_order.groupby('City').Sales.agg(['sum']).sort(['sum'], ascending=False)[0:10]

/anaconda/envs/py27/lib/python2.7/site-packages/ipykernel/__main__.py:11: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)

               sum
City
London     69230.0
Berlin     52555.0
Vienna     51844.0
Madrid     44981.0
Paris      42245.0
Rome       28330.0
Barcelona  27405.0
Hamburg    23574.0
Marseille  21677.0
Turin      19829.0

### 12.1 .Create a Column called 'Shipping Delay' on the 'orders' table, which is the difference in days between 'Order Date' and 'Ship Date'.

In [80]:
query12= 'SELECT * FROM ListOfOrders'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query12, con = connection)

q_order.head()

,Order ID,Order Date,Customer Name,City,Country,Region,Segment,Ship Date,Ship Mode,State
0,BN-2011-7407039,1/1/2011,Ruby Patel,Stockholm,Sweden,North,Home Office,1/5/2011,Economy Plus,Stockholm
1,AZ-2011-9050313,1/3/2011,Summer Hayward,Southport,United Kingdom,North,Consumer,1/7/2011,Economy,England
2,AZ-2011-6674300,1/4/2011,Devin Huddleston,Valence,France,Central,Consumer,1/8/2011,Economy,Auvergne-Rhône-Alpes
3,BN-2011-2819714,1/4/2011,Mary Parker,Birmingham,United Kingdom,North,Corporate,1/9/2011,Economy,England
4,AZ-2011-617423,1/5/2011,Daniel Burke,Echirolles,France,Central,Home Office,1/7/2011,Priority,Auvergne-Rhône-Alpes

In [81]:
q_order['Seprate_date_Order']=pd.to_datetime(q_order['Order Date'])
q_order['Seprate_date_Ship']=pd.to_datetime(q_order['Ship Date'])

In [82]:
q_order['Delay']=(q_order['Seprate_date_Ship'] - q_order['Seprate_date_Order']).astype(str)


q_order.head()

,Order ID,Order Date,Customer Name,City,Country,Region,Segment,Ship Date,Ship Mode,State,Seprate_date_Order,Seprate_date_Ship,Delay
0,BN-2011-7407039,1/1/2011,Ruby Patel,Stockholm,Sweden,North,Home Office,1/5/2011,Economy Plus,Stockholm,2011-01-01,2011-01-05,4 days 00:00:00.000000000
1,AZ-2011-9050313,1/3/2011,Summer Hayward,Southport,United Kingdom,North,Consumer,1/7/2011,Economy,England,2011-01-03,2011-01-07,4 days 00:00:00.000000000
2,AZ-2011-6674300,1/4/2011,Devin Huddleston,Valence,France,Central,Consumer,1/8/2011,Economy,Auvergne-Rhône-Alpes,2011-01-04,2011-01-08,4 days 00:00:00.000000000
3,BN-2011-2819714,1/4/2011,Mary Parker,Birmingham,United Kingdom,North,Corporate,1/9/2011,Economy,England,2011-01-04,2011-01-09,5 days 00:00:00.000000000
4,AZ-2011-617423,1/5/2011,Daniel Burke,Echirolles,France,Central,Home Office,1/7/2011,Priority,Auvergne-Rhône-Alpes,2011-01-05,2011-01-07,2 days 00:00:00.000000000

In [83]:
q_order['Delay'] = q_order['Delay'].str[:-23]

In [86]:
q_order['Delay'] = q_order['Delay'].astype(float)

In [87]:
q_order.head()

,Order ID,Order Date,Customer Name,City,Country,Region,Segment,Ship Date,Ship Mode,State,Seprate_date_Order,Seprate_date_Ship,Delay
0,BN-2011-7407039,1/1/2011,Ruby Patel,Stockholm,Sweden,North,Home Office,1/5/2011,Economy Plus,Stockholm,2011-01-01,2011-01-05,4.0
1,AZ-2011-9050313,1/3/2011,Summer Hayward,Southport,United Kingdom,North,Consumer,1/7/2011,Economy,England,2011-01-03,2011-01-07,4.0
2,AZ-2011-6674300,1/4/2011,Devin Huddleston,Valence,France,Central,Consumer,1/8/2011,Economy,Auvergne-Rhône-Alpes,2011-01-04,2011-01-08,4.0
3,BN-2011-2819714,1/4/2011,Mary Parker,Birmingham,United Kingdom,North,Corporate,1/9/2011,Economy,England,2011-01-04,2011-01-09,5.0
4,AZ-2011-617423,1/5/2011,Daniel Burke,Echirolles,France,Central,Home Office,1/7/2011,Priority,Auvergne-Rhône-Alpes,2011-01-05,2011-01-07,2.0

### 12.2 Update your Orders table in your Sqlite DB to include the 'Shipping Delay' feature.

In [88]:
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order.to_sql(name = 'q_order_list', con = connection, if_exists = 'replace', index = False)

### 12.3 Which Product Category has the highest average 'Shipping Delay'

In [89]:
query13= 'SELECT `Category`,`Delay` FROM q_order_list,OrderBreakdown where (q_order_list.`Order ID` = OrderBreakdown.`Order ID` )'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query13, con = connection)
q_order.head()

q_order.groupby('Category').Delay.agg(['sum']).sort(['sum'], ascending=False)[0:10]

/anaconda/envs/py27/lib/python2.7/site-packages/ipykernel/__main__.py:6: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)

                     sum
Category
Office Supplies  21012.0
Technology        6283.0
Furniture         4952.0

# Hard Mode:

### 13. In what months and Categories were Sales Targets Exceeded?

In [215]:
query16= 'SELECT `Category`,Seprate_date_Order,Sales,Target FROM q_order,OrderBreakdown,ListOfOrders where q_order.`Order ID` = OrderBreakdown.`Order ID` AND SalesTargets.Category = OrderBreakdown.Category'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query16, con = connection)

query17= 'SELECT `Category`,Seprate_date_Order,Sales,Target FROM q_order,OrderBreakdown,ListOfOrders where q_order.`Order ID` = OrderBreakdown.`Order ID` AND AND SalesTargets.Category = OrderBreakdown.Category'
connection = sqlite3.connect('data/sql/test.db.sqlite')
q_order = sql.read_sql(query17, con = connection)



q_order['Seprate_date_Order']=pd.to_datetime(q_order['Seprate_date_Order'])
q_order['Month'] = q_order['Seprate_date_Order'].dt.month

q_order.groupby('Month').Category.value_counts('Category')

DatabaseError: Execution failed on sql 'SELECT `Category`,Seprate_date_Order,Sales,Target FROM q_order,OrderBreakdown,ListOfOrders where q_order.`Order ID` = OrderBreakdown.`Order ID` AND AND SalesTargets.Category = OrderBreakdown.Category': near "AND": syntax error

### 14. In what months and Categories did Sales fail to exceed their targets?